package Year

import (
	"net/http"

	"github.com/gin-gonic/gin"

	"tools_more/Common"
	"tools_more/Year/Controller"
)

func IncAction(r *gin.Engine) {
	r.GET("/year/list/:OpenID", Controller.List)

	r.GET("/year/from/:OpenID", func(context *gin.Context) {
		var blessingData = []string{
			"春节快乐！愿你福禄财神紧拥抱，事业顺心顺意！工作顺顺利利！爱情甜甜蜜蜜！滚滚财源广进！",
			"志在哪里，哪里就有成功；心在哪里，哪里就有风景；爱在哪里，哪里就有感动。在新年来临之际，衷心祝愿春节快乐，身体健康，心想事成！",
			"新春佳节到，向你问个好；身体倍健康，心情特别好；好运天天交，口味顿顿妙；家里出黄金，墙上长钞票。",
			"这是春的开头，虽然你在那头，我在这头，还是把你记在心头。在这寒冷关头，愿我的祝福温暖你的手头，直达你的心头，春节假期快乐！",
			"春风得意马驰千里，旭日扬辉光照万家。山川添秀岁月更新，大地欢腾春回有意。福满人间气象更新，前程广阔日进无疆。春节到了，愿你合家团圆。",
			"高雅的人，看背影就知道；奋进的人，听脚步就知道；和善的人，看笑脸就知道；自信的人，看眼神就知道；吉祥的人，看您就知道。祝新年快乐！",
			"在关爱中让友情更深，在牵挂中让亲情更暖，在老实中让心底更静，在简单中让生活更美，在问候中让祝福更好，在祝福中让春节更快乐！",
			"早一点，晚一点，祝福不少，收到就好；远一点近一点，不是问题，心无距离；长一点短一点，话多话少，心意不少；节日很好，我愿赶早：春节快乐！",
			"鞭炮的响声再一次响起，在新的一年中我祝大家永远生龙活虎，身体健康，事业顺利。当然，也要祝我自己学习进步，家人身体健康。我给大家拜年了！",
			"一切的美好源于真挚和坦诚，虽然岁月不会轮回，天真不再重现，一份真诚的祝福，会让你快乐每一天！",
			"淡淡一点的友情很真，淡淡一点的依恋很轻，淡淡一点的思念很深，淡淡一点的祝福最真！祝你新年快乐！",
			"这一刻有我最深的思念。让云捎去满心的祝福，点缀你甜蜜的梦。愿你拥有一个幸福快乐的新年！",
			"酒越久越醇，水越流越清，世间沧桑越流越淡，朋友情谊越久越真。衷心祝福吾友度过一个祥和美满的新年！",
			"请你打开窗，让新春的风吹进你的屋子，让新春的雪飞进你的屋子，让我新春的祝愿，飘进你的心坎！",
			"愿你享有期望中的全部喜悦，每一件微小的事物都能带给你甜美的感受和无穷的快乐，愿你新年快乐！",
			"冰封的世界怎么能一夜间解冻复苏，初醒的大地怎么能一夜间繁花喷香？新的一年，愿你不断积累，祝你有所创造。",
			"新年之际，祝你：大财小财意外财，财源滚滚；亲情爱情朋友情，份份真情；爱人亲人知心人，人人平安；官运福运桃花运，天天走运！",
			"打开吉祥的邮包，将好运抽取，吉星高照；将快乐释放，开心无限；将喜气蔓延，心花怒放；将健康赐予，福寿无边；将祝福呈上，锦上添花：祝新年开怀，万事如意！",
			"时间从指间溜走，默默无闻中，又一个新的年头。寒来暑去，春夏冬秋，别在匆匆的奔走。新年将近，此情悠悠。愿你新年争上游，幸福长长久！",
			"在新年的钟声里举起杯，任酒的醇香在空气中荡漾，任我对你的感激在杯里慢慢沉淀，深深祝福我的朋友，祝你新年幸福美满，健康快乐！",
			"岁末年初，回首过去，拼搏与汗水，换来今天的喜悦与收获，总结过去，勤奋加努力，得来今天的幸福与成功；展望来年，愿你再接再励，鼓劲加油，争取创造更大的辉煌！",
			"平常日子平常心，淡淡相思传真情。你我友情在日里，短信传递真情意。送上问候和祝福，不问新年和新年，此时此刻此真意，愿你开心永幸福！",
			"新年你将运气走俏！老板器重你，亲友关照你，金钱青睐你，异性仰慕你，脾气由着你，美事儿想到你！",
			"祝愿你把新年的金财、银财、大财、小财汇成万贯家财；再用你的朝气、英气、正气、勇气换得一团和气；保你才气熏天、富贵连连、家和万事兴！",
			"新春到来喜事多，合家团圆幸福多；心情愉快朋友多，身体健康快乐多；一切顺利福气多，新年吉祥生意多；祝您好事多！多！多！",
			"一生中总有些朋友难忘记！一年中总有些日子最珍惜！认识你以来，虽然不能时时想起，但总会在这特别的日子轻轻地问候你：新年快乐！",
			"在新的一年里祝：春风洋溢你，家庭关心你，爱情滋润你，财神系着你，你朋友忠于你，我这儿祝福你，幸运之星永远照着你，新年快乐！",
			"许个心愿，所有的愿望都能实现；祈祷心声，所有的希望都能如愿；祝福心曲，所有的好运都能兑现；祈福心情，所有的付出都很香甜；新的一年里，祝你万事随缘，快乐相连。",
			"祝你在新的一年里：身体健康平安，生活充实饱满，事业步步高升，心情阳光灿烂，财运滚滚而来，家庭美满幸福，新年开心快乐！",
			"古有愚公移山，铁杵成针，滴水成江，但都不及我对你的祝福。让我这份新年祝福通过电波，跨过重重高山，越过滔滔江水，掠过高楼大厦，飞到你身边。",
			"新年又至送去大衣一件，用它裹住温情，怀揣浪漫的爱情，兜满幸福的友情，扣紧身体健康，阻隔厄运，每天都有好心情！",
			"此信短短无墨香，字里行间祈愿忙，夜夜华灯伴星光，日日希冀暗流淌，幸福新年好时光，心中情谊总激荡，愿你新的一年幸福无忧，新年欢畅！",
			"过去一年你勤奋又努力，洒下汗水把成绩揽在怀里。新的一年即将开始，告别骄傲继续努力，创造辉煌胜过过去。愿你在新年里树下凌云志，满载喜悦幸福归！",
			"钟声是我的祈祷，炮声是我的祝福，歌声是我的问候，雪花是我的贺卡，美酒是我的亲吻，清风是我的拥抱，快乐是我的礼物！祝新年健康，快乐，大吉！",
			"距离之隔并不意味分离，疏于联系并不意味忘记，不能相见并不意味冷漠，一切只因为我们都活在忙碌交织的岁月里，但我依然记得你，祝你新年快乐！",
			"新春已来到，信息不能迟到，好友前来报到，祝福提前送到：爱情浪漫美好，友情温暖笼罩，亲情时刻围绕，工作业绩攀高，生活幸福欢笑，来年更美好！",
			"千祥云集庆有余，百福骈臻贺新春！青山依旧在，祝福年年有！朋友，新的一年锦上添花！",
			"一枚枯草一枚戒，一朵小花一情人。风花雪月虽滋润，似水流年添伤痕。工作时间全是混，娱乐时候太认真。励精图治振乾坤，不只嘿呦最销魂。愿君快乐多如意，健健康康闹新年！",
			"这一刻，让云儿将我最深的思念捎到你的身边，点缀你那甜蜜的梦，愿你拥有一个幸福美满的新年！",
			"有些事不会因时光流逝而褪去，有些人不会因不常见面而忘记，在我心里你是我永远的朋友。在新年到来之际，恭祝好友平安幸福！",
			"新年又到祝福也到。祝福我的朋友：前途平坦，兜里有款，甜长苦短；薪水翻番，好吃好穿，常有新欢，追求的路程越走越宽！",
			"过去的一年里，你的努力犹如惊叹号，艰辛异常；你的收获好比句号，圆圆满满；你的成功就像省略号，绵延不断；新一年到来，预祝你，再接再励，来年大展身手，为事业的道路上留下辉煌的手笔！",
			"新年祝你乐开花：美丽胜鲜花，浪漫如樱花，吉祥似雪花，运气逢桃花，富贵赛牡丹花，芬芳攀过茉莉花！",
			"是您指引我走出第一步，帮助我找到以后的路，谢谢您，妈妈！祝您新年快乐，身体健康，永远开心。",
			"春风洋溢你；家人关心你；爱滋润你；财神记着你；朋友忠于你；我这儿祝福你；幸运之星永远照着你！",
			"一只鸟儿飞，越过快乐领，看到欢乐谷，途径幸福泉，喝下吉祥水，衔朵幸运花，唱支祝福歌，飘进手机里，祝你新年吉祥快乐！",
			"不管汗能流多少，也不怕血可洒许多，我们在今天铭刻下人生的理想，我们将永远和懒惰与涣散作别！",
			"一句平淡如水的问候，很轻；一声平常如纸的祝福，很真；摘一颗星，采一朵云，装入平安的信封里送给你，让快乐好运时刻围绕着你！你新年快乐！",
			"新的新年祝福你：老板顺着你，敌人躲着你，爱人体贴你，贵人帮着你，家人护着你，彩卷偏向你，升官发财随便你！",
			"郑重声名：此条短信乃是我独家，绝对首发、不曾转发、不曾见过、情真意浓、原装正版、翻版必究、如有雷同、纯属巧合。新年快乐！",
		}

		var backgroundData = []string{
			"https://qiniu.18x6.com/year_bj1.png",
			"https://qiniu.18x6.com/year_bj2.png",
			"https://qiniu.18x6.com/year_bj3.png",
			"https://qiniu.18x6.com/year_bj4.png",
		}

		var fu = []string{
			"https://qiniu.18x6.com/year_f1.png",
			"https://qiniu.18x6.com/year_f2.png",
			"https://qiniu.18x6.com/year_f3.png",
			"https://qiniu.18x6.com/year_f4.png",
			"https://qiniu.18x6.com/year_f5.png",
			"https://qiniu.18x6.com/year_f6.png",
		}

		context.HTML(http.StatusOK, "year_add.html", gin.H{
			"blessing":   blessingData,
			"background": backgroundData,
			"fu":         fu,
		})
	})

	r.GET("/year/item/:ID", Controller.Item)

	r.POST("/year/add", Controller.Add)

	r.POST("/year/token", func(context *gin.Context) {
		context.JSON(http.StatusOK, gin.H{
			"token": Common.QiNiuToken(""),
		})
	})
}
